In [1]:
import pandas as pd

In [ ]:
# 예시 csv 데이터 불러오기
titanic_df = pd.read_csv('./titanic_train.csv')
print(f'titanic 변수 type: {type(titanic_df)}')

# df.head(5) : 맨 앞의 5개의 데이터만 출력
display(titanic_df.head(5))

# df.tail(5) : 맨 뒤의 5개의 데이터만 출력
display(titanic_df.tail(5))

# df.shape : 행과 열의 크기를 반환
display(f'{type(titanic_df.shape)} : {titanic_df.shape}')
display(titanic_df.shape)

In [15]:
# DataFrame 생성
# 딕셔너리를 이용하여 DataFrame 생성

temp_dict = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [24, 13, 53, 33],
}
# key가 column 이름이 되고, value가 column의 데이터가 된다.

temp_df_01 = pd.DataFrame(temp_dict)
display(temp_df_01)

# column 이름을 정하여 DataFrame 생성
temp_df_02 = pd.DataFrame(temp_dict, columns=['Age', 'Name', 'Gender'])
# -> dict의 key에 해당하는 column이 없으면 NaN으로 채워진다.
display(temp_df_02)

    Name  Age
0   John   24
1   Anna   13
2  Peter   53
3  Linda   33

   Age   Name Gender
0   24   John    NaN
1   13   Anna    NaN
2   53  Peter    NaN
3   33  Linda    NaN

In [22]:
# DataFrame의 column 이름 확인
temp_df_02_columns = temp_df_02.columns
print(f'{type(temp_df_02_columns)}:\n{temp_df_02_columns}')  # Index 객체로 반환된다.
print('')  # 줄바꿈

# DataFrame의 index 확인
temp_df_02_index = temp_df_02.index
print(f'{type(temp_df_02_index)}:\n{temp_df_02_index}')  # RangeIndex 객체로 반환된다.

# DataFrame의 values 확인
temp_df_02_values = temp_df_02.values
print(f'{type(temp_df_02_values)}:\n{temp_df_02_values}')  # numpy의 ndarray로 반환된다.

<class 'pandas.core.indexes.base.Index'>:
Index(['Age', 'Name', 'Gender'], dtype='object')

<class 'pandas.core.indexes.range.RangeIndex'>:
RangeIndex(start=0, stop=4, step=1)
<class 'numpy.ndarray'>:
[[24 'John' nan]
 [13 'Anna' nan]
 [53 'Peter' nan]
 [33 'Linda' nan]]

In [25]:
# DataFrame의 정보 확인
temp_df_02_info = temp_df_02.info()
print(f'{temp_df_02_info}')  # info()는 None을 반환한다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     4 non-null      int64
 1   Name    4 non-null      object
 2   Gender  0 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [18]:
# DataFrame의 기초 통계 정보 확인
titanic_df = pd.read_csv('./titanic_train.csv')
titanic_df.describe()
print(f'{type(titanic_df.describe())}')

# value_counts() : Series 객채의 메소드. 해당 series의 값 분포를 확인.
titanic_Pclass_value_counts = titanic_df['Pclass'].value_counts(dropna=False)
titanic_cabin_value_counts = titanic_df['Cabin'].value_counts(dropna=False)
print(f'{type(titanic_Pclass_value_counts)}:\n{titanic_Pclass_value_counts}')
print(f'{type(titanic_cabin_value_counts)}:\n{titanic_cabin_value_counts}')

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>:
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
<class 'pandas.core.series.Series'>:
Cabin
NaN            687
C23 C25 C27      4
G6               4
B96 B98          4
C22 C26          3
              ...
E34              1
C7               1
C54              1
E36              1
C148             1
Name: count, Length: 148, dtype: int64

# DataFrame <-> list, dict, ndarray 변환

In [66]:
# list -> DataFrame
temp_list = [24, 13, 53, 33]
temp_df_from_list = pd.DataFrame(temp_list, columns=['age'])
display(temp_df_from_list)

# dict -> DataFrame
temp_dict_01 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [24, 13, 53, 33],
}
temp_df_from_dict_01 = pd.DataFrame(temp_dict_01)
display(temp_df_from_dict_01)

# JSON 같은 형태의 데이터가 들어오면 어떻게 하나?
temp_dict_02 = {'user01': {'Name': 'John', 'Age': 24}, 'user02': {'Name': 'Anna', 'Age': 13},
                'user03': {'Name': 'Peter', 'Age': 53}, 'user04': {'Name': 'Linda', 'Age': 33}}

temp_df_from_dict_02 = pd.DataFrame(temp_dict_02)
display(temp_df_from_dict_02)

# change temp_dict_02 to make df with columns=['Name', 'Age']
temp_df_from_dict_02 = pd.DataFrame(temp_dict_02).T
display(temp_df_from_dict_02)

# ndarray -> DataFrame
import numpy as np

temp_ndarray = np.array([[24, 13, 53, 33], ['John', 'Anna', 'Peter', 'Linda']])
temp_df_from_ndarray = pd.DataFrame(temp_ndarray.T, columns=['Age', 'Name'])
display(temp_df_from_ndarray)

   age
0   24
1   13
2   53
3   33

    Name  Age
0   John   24
1   Anna   13
2  Peter   53
3  Linda   33

     user01 user02 user03 user04
Name   John   Anna  Peter  Linda
Age      24     13     53     33

         Name Age
user01   John  24
user02   Anna  13
user03  Peter  53
user04  Linda  33

  Age   Name
0  24   John
1  13   Anna
2  53  Peter
3  33  Linda

In [67]:
# DataFrame -> list
# values 속성으로 ndarray화. 이후 tolist()로 리스트화.
list_from_df = temp_df_from_dict_02.values.tolist()
print(f'{type(list_from_df)}:\n{list_from_df}')

# DataFrame -> ndarray
# values 속성으로 ndarray화.
ndarray_from_df = temp_df_from_dict_02.values
print(f'{type(ndarray_from_df)}:\n{ndarray_from_df}')

# DataFrame -> dict
# df.to_dict() method 이용 dict화.
dict_from_df = temp_df_from_dict_02.to_dict()
print(f'{type(dict_from_df)}:\n{dict_from_df}')

<class 'list'>:
[['John', 24], ['Anna', 13], ['Peter', 53], ['Linda', 33]]
<class 'numpy.ndarray'>:
[['John' 24]
 ['Anna' 13]
 ['Peter' 53]
 ['Linda' 33]]
<class 'dict'>:
{'Name': {'user01': 'John', 'user02': 'Anna', 'user03': 'Peter', 'user04': 'Linda'}, 'Age': {'user01': 24, 'user02': 13, 'user03': 53, 'user04': 33}}

# DataFrame 데이터 생성, 변경, 삭제

In [68]:
display(temp_df_from_dict_02)
temp_df_from_dict_03 = temp_df_from_dict_02
# 새로운 컬럼 생성
temp_df_from_dict_03['new_col'] = [1, 2, 3, 4]
temp_df_from_dict_03['new_col_x10'] = temp_df_from_dict_03['new_col'] * 10
display(temp_df_from_dict_03)

# 컬럼 값 변경
temp_df_from_dict_03['new_col'] = [5, 6, 7, 8]
display(temp_df_from_dict_03)

         Name Age
user01   John  24
user02   Anna  13
user03  Peter  53
user04  Linda  33

         Name Age  new_col  new_col_x10
user01   John  24        1           10
user02   Anna  13        2           20
user03  Peter  53        3           30
user04  Linda  33        4           40

         Name Age  new_col  new_col_x10
user01   John  24        5           10
user02   Anna  13        6           20
user03  Peter  53        7           30
user04  Linda  33        8           40

In [69]:
# DataFrame 데이터 삭제
# df.drop() method 이용한다.
# axis=0 이면 row, axis=1 이면 column 의미.
# inplace=True 이면 원본 DataFrame을 변경한다. 기본값은 False.
temp_df = temp_df_from_dict_03

temp_df_dropped = temp_df.drop(labels=['Age', 'new_col'], axis=1)
display(temp_df_dropped)
display(temp_df)

         Name  new_col_x10
user01   John           10
user02   Anna           20
user03  Peter           30
user04  Linda           40

         Name Age  new_col  new_col_x10
user01   John  24        5           10
user02   Anna  13        6           20
user03  Peter  53        7           30
user04  Linda  33        8           40

# Index 객체

In [78]:
# Index 객체에 대하여
# Index 객체는 DataFrame, Series의 각 정보를 고유하게 식별하는 역할.
# 이 때, 만들어진 df 앞에 붙어있는 Index는 하나의 컬럼으로 인식되지 않는다.

# Index 객체의 추출을 위해선 dataframe/series의 index 속성을 이용한다.
temp_df_for_index = temp_df_from_dict_03
display(temp_df_for_index.index)
index_array = temp_df_for_index.index.values  # 값을 받아와 쓰려면 ndarray로 받아온다.
print(f'{type(index_array)}:\n{index_array}')

# Index를 초기화하려면 dataframe/series 의 reset_index() 함수를 이용한다.
# 이때도 기존에 있던 dataframe을 이용하려는게 기본설정이라 inplace=False 되어있다.
# 메모리 아끼기 위해서 inplace=True로 바꿔줄 수 있다.
# 인덱스 리셋되면 기존 인덱스는 가장 첫 column에 index 이름으로 만들어진다.
# 새로운 인덱스는 RangeIndex로 초기화된다.
df_index_reset = temp_df_for_index.reset_index()  # inplace=False 기본.
display(df_index_reset)
print(f'{type(df_index_reset.index)}:\n{df_index_reset.index}')

# 변경하려면 Index 객체에 새로운 정보들을 list로 넣어준다.
df_index_reset.index = [10, 11, 12, 13]
display(df_index_reset)
print(f'{type(df_index_reset.index)}:\n{df_index_reset.index}')

Index(['user01', 'user02', 'user03', 'user04'], dtype='object')

<class 'numpy.ndarray'>:
['user01' 'user02' 'user03' 'user04']

    index   Name Age  new_col  new_col_x10
0  user01   John  24        5           10
1  user02   Anna  13        6           20
2  user03  Peter  53        7           30
3  user04  Linda  33        8           40

<class 'pandas.core.indexes.range.RangeIndex'>:
RangeIndex(start=0, stop=4, step=1)

     index   Name Age  new_col  new_col_x10
10  user01   John  24        5           10
11  user02   Anna  13        6           20
12  user03  Peter  53        7           30
13  user04  Linda  33        8           40

<class 'pandas.core.indexes.base.Index'>:
Index([10, 11, 12, 13], dtype='int64')

# DataFrame 인덱싱, 필터링

In [1]:
import pandas as pd

In [2]:
# Dataframe 인덱싱
titanic_df = pd.read_csv('./titanic_train.csv')
display(titanic_df)
print(f'{titanic_df.columns.values}')

titanic_df_pclass = titanic_df['Pclass']  # PClass 컬럼에 대한 정보를 Series로 반환된다. Series는 Column 이름 없다.
display(titanic_df_pclass)
# [] 인덱싱 자리에 여러 개가 들어간 리스트를 입력하면 DataFrame으로 반환.
passengerid_name_pcalss= titanic_df[['PassengerId', 'Name', 'Pclass']]
display(passengerid_name_pcalss)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

     PassengerId                                               Name  Pclass
0              1                            Braund, Mr. Owen Harris       3
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2              3                             Heikkinen, Miss. Laina       3
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4              5                           Allen, Mr. William Henry       3
..           ...                                                ...     ...
886          887                              Montvila, Rev. Juozas       2
887          888                       Graham, Miss. Margaret Edith       1
888          889           Johnston, Miss. Catherine Helen "Carrie"       3
889          890                              Behr, Mr. Karl Howell       1
890          891                                Dooley, Mr. Patrick       3

[891 rows x 3 columns]

In [3]:
# Boolean Indexing
# boolean series 넣어서 조건에 맞는 데이터만 추출할 수 있다.

# print(f'{type((titanic_df["Pclass"]==3))}')
boolean_titanic_pclass=titanic_df[(titanic_df['Pclass']==3)]
print(f'{type(boolean_titanic_pclass)}')
display(boolean_titanic_pclass)

# 여러 개 조건이 있을 때를 생각해보자.
# 나이가 60세 이상, 클래스는 1등급, 남자.
cond_1 = titanic_df['Age']>=60
cond_2 = titanic_df['Pclass']==1
cond_3 = titanic_df['Sex']=='male'
display(titanic_df[cond_1&cond_2&cond_3])

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.2000,B41,C
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.5500,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S

# Dataframe 정렬, Aggregation, Group by

In [4]:
# Dataframe 정렬.
# sort_values() method 이용. by 인자를 통해 정렬하려는 기준 column 받아온다.
titanic_sorted =titanic_df.sort_values(by=['Pclass', 'Name'], ascending=True)
display(titanic_sorted)

# Aggregation (집합연산)
# sum, min, max, mean, count 의미한다. 
titanic_sum = titanic_df[['Pclass', 'Survived','Age']].sum()
titanic_min = titanic_df[['Pclass', 'Survived','Age']].min()
titanic_max = titanic_df[['Pclass', 'Survived','Age']].max()
titanic_mean = titanic_df[['Pclass', 'Survived','Age']].mean()
titanic_count = titanic_df[['Pclass', 'Survived','Age']].count()

print(f'{type(titanic_sum)}:\n{titanic_sum}')
print(f'{type(titanic_min)}:\n{titanic_min}')
print(f'{type(titanic_max)}:\n{titanic_max}')
print(f'{type(titanic_mean)}:\n{titanic_mean}')
print(f'{type(titanic_count)}:\n{titanic_count}')

# 이 때, count는 null 값 빼고 카운트 해준다.
# null값 분포를 알기 위해선?
# isna() method 이용. True/False DataFrame으로 반환된다.
# 그리고 sum() method 이용해서 각 column 별 null값의 개수를 알 수 있다. 반환 타입은 Series.
display(titanic_df.isna().sum())
print(f'{type(titanic_df.isna().sum())}')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
460,461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
...,...,...,...,...,...,...,...,...,...,...,...,...
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.00,1,0,345572,17.4000,NaN,S
286,287,1,3,"de Mulder, Mr. Theodore",male,30.00,0,0,345774,9.5000,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.00,0,0,345778,9.5000,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.50,0,2,A/5. 851,14.5000,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

<class 'pandas.core.series.Series'>:
Pclass       2057.00
Survived      342.00
Age         21205.17
dtype: float64
<class 'pandas.core.series.Series'>:
Pclass      1.00
Survived    0.00
Age         0.42
dtype: float64
<class 'pandas.core.series.Series'>:
Pclass       3.0
Survived     1.0
Age         80.0
dtype: float64
<class 'pandas.core.series.Series'>:
Pclass       2.308642
Survived     0.383838
Age         29.699118
dtype: float64
<class 'pandas.core.series.Series'>:
Pclass      891
Survived    891
Age         714
dtype: int64

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

<class 'pandas.core.series.Series'>

In [5]:
# groupby() 메소드. SQL group 명령어 역할.
# count, min, max, sum, mean 등의 aggregation 작업을 하고 싶은데, 그룹을 지어서 보고 싶을 때 쓴다.
# 예를 들어, 선실등급에 따라서 각 count가 어떻게 되는지?

titanic_groupby = titanic_df.groupby(by=['Pclass']) # 결과가 DataFrameGroupBy 객체로 나온다.
print(f'{type(titanic_groupby)}') # DataFrameGroupBy 객체는 바로 눈으로 확인할 수 없다.

# 눈으로 보려면 원하는 데이터들에 대한 aggregation 연산 적용.
titanic_groupby[['Name', 'Fare']].count()

# 각 컬럼에 서로 다른 aggregation을 적용하고 싶다면?
# agg() method 에다가 dictionary를 만들어서 적용해준다.
agg_rule = {'Fare':'mean','Age':'max'}
display(titanic_df.groupby('Pclass').agg(agg_rule))

# 나이의 최대, 평균, 최소를 알고 싶다면?
# named aggregation 이용한다.
display(titanic_df.groupby('Pclass').agg(
    min_Age = ('Age', 'min'),
    max_Age = ('Age', 'max'),
    mean_Age = ('Age','mean'),
    std_Age = ('Age','std')
))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

             Fare   Age
Pclass
1       84.154687  80.0
2       20.662183  70.0
3       13.675550  74.0

        min_Age  max_Age   mean_Age    std_Age
Pclass
1          0.92     80.0  38.233441  14.802856
2          0.67     70.0  29.877630  14.001077
3          0.42     74.0  25.140620  12.495398

# nunique(), Replace()

In [15]:
# nunique() 메소드는 해당 시리즈의 고유값이 몇개 있는지 체크.
# return type: int
print(f'{type(titanic_df["Pclass"].nunique())}: {titanic_df["Pclass"].nunique()}')
print(f'{type(titanic_df["Name"].nunique())}: {titanic_df["Name"].nunique()}')
# unique() 메소드 이용하면 고유값들을 series로 반환해준다.
print(f'{type(titanic_df["Pclass"].unique())}: {titanic_df["Pclass"].unique()}')


# replace() 메소드는 시리즈 선택후 그 시리즈의 기존값과 이후 값을 바꾼다.
# 이 때, 딕셔너리를 이용하여 여러 값을 바꿀 수 있다.
titanic_df['Sex'].replace('male','Man')
titanic_df['Sex'].replace({'male':'Man', 'female':'Woman'})

<class 'int'>: 3
<class 'int'>: 891
<class 'numpy.ndarray'>: [3 1 2]

0        Man
1      Woman
2      Woman
3      Woman
4        Man
       ...
886      Man
887    Woman
888    Woman
889      Man
890      Man
Name: Sex, Length: 891, dtype: object

# 람다식 이용 데이터 가공

In [21]:
# lambda 식 -> 일회용 함수. apply() 함수 안에 람다식 넣어서 적용한다.
# JS (a,b,c)=>{a~~~;b~~~;c~~~;} 랑 같은 역할. lambda x : x~~~

titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
display(titanic_df)

titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x<=15 else 'Adult')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_len
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,22
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,44
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,24
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,21
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,28
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,40
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,21
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,19